perf-test/update-test-result-1000-60.txt
Run each test for 60 seconds with a rate of 1000 requests/second.
Start with ID 0

Patient Update Tests:
Requests      [total, rate]            60000, 1000.02
Duration      [total, attack, wait]    1m0.001453506s, 59.998798787s, 2.654719ms
Latencies     [mean, 50, 95, 99, max]  3.672032ms, 2.837461ms, 7.023291ms, 13.628235ms, 290.097137ms
Bytes In      [total, mean]            9035991, 150.60
Bytes Out     [total, mean]            4788890, 79.81
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:60000
Error Set:
Condition Update Tests:
Requests      [total, rate]            60000, 1000.02
Duration      [total, attack, wait]    1m0.001614768s, 59.998925242s, 2.689526ms
Latencies     [mean, 50, 95, 99, max]  6.556032ms, 3.474806ms, 9.791656ms, 49.919238ms, 884.508165ms
Bytes In      [total, mean]            16472520, 274.54
Bytes Out     [total, mean]            12217780, 203.63
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:60000
Error Set:
Observation Update Tests:
Requests      [total, rate]            60000, 1000.02
Duration      [total, attack, wait]    1m0.001728564s, 59.998613246s, 3.115318ms
Latencies     [mean, 50, 95, 99, max]  5.152487ms, 3.977236ms, 10.582253ms, 17.855264ms, 273.440732ms
Bytes In      [total, mean]            21092552, 351.54
Bytes Out     [total, mean]            16837780, 280.63
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:60000
Error Set:
Specimen Update Tests:
Requests      [total, rate]            60000, 1000.02
Duration      [total, attack, wait]    1m0.00164896s, 59.998988911s, 2.660049ms
Latencies     [mean, 50, 95, 99, max]  5.28946ms, 3.125479ms, 8.535725ms, 24.117931ms, 648.464655ms
Bytes In      [total, mean]            18392483, 306.54
Bytes Out     [total, mean]            14137780, 235.63
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:60000
Error Set: