perf-test/update-test-result-1000-60.txt
Run each test for 60 seconds with a rate of 1000 requests/second.
Start with ID 0

Patient Update Tests:
Requests      [total, rate]            60000, 1000.02
Duration      [total, attack, wait]    1m0.00209049s, 59.99887116s, 3.21933ms
Latencies     [mean, 50, 95, 99, max]  3.527543ms, 2.638659ms, 6.953507ms, 15.599162ms, 201.908465ms
Bytes In      [total, mean]            9035991, 150.60
Bytes Out     [total, mean]            4788890, 79.81
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:60000
Error Set:
Condition Update Tests:
Requests      [total, rate]            60000, 1000.02
Duration      [total, attack, wait]    1m0.002882738s, 59.9986777s, 4.205038ms
Latencies     [mean, 50, 95, 99, max]  4.099646ms, 3.281882ms, 8.013998ms, 14.248084ms, 195.375435ms
Bytes In      [total, mean]            16472520, 274.54
Bytes Out     [total, mean]            12217780, 203.63
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:60000
Error Set:
Observation Update Tests:
Requests      [total, rate]            60000, 1000.02
Duration      [total, attack, wait]    1m0.002226749s, 59.998793946s, 3.432803ms
Latencies     [mean, 50, 95, 99, max]  5.80995ms, 3.829456ms, 12.440745ms, 28.779485ms, 507.781865ms
Bytes In      [total, mean]            21092552, 351.54
Bytes Out     [total, mean]            16837780, 280.63
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:60000
Error Set:
Specimen Update Tests:
Requests      [total, rate]            60000, 1000.02
Duration      [total, attack, wait]    1m0.001206923s, 59.998652129s, 2.554794ms
Latencies     [mean, 50, 95, 99, max]  3.533527ms, 2.767909ms, 6.931535ms, 13.868393ms, 164.20693ms
Bytes In      [total, mean]            18392483, 306.54
Bytes Out     [total, mean]            14137780, 235.63
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:60000
Error Set: